// ebcdic.cpp
#include "ebcdic.h"
#include <mbstring.h>//for _mbcjmstojis()
#include "atd.regex.h"
//====================================================
//= struct ebddic
//====================================================
uchar ebcdic::tosjis(BYTE ebc)
{
	return (uchar)EBC2SJIS[ebc];
}
//====================================================
//= struct ebddic::jef
//====================================================
ebcdic::jef::jef()
{
	expand();
}
WORD ebcdic::jef::tosjis(WORD jef)
{
	static struct jef me;
	return me._tosjis(jef);
}
WORD ebcdic::jef::_tosjis(WORD jef) const
{
	const_iterator i = find(jef);
	return ::_mbcjistojms(
		i == end()
		? jef - 0x8080
		: i->second
		);
}
void ebcdic::jef::expand()
{
	struct regex regex;
	strings ss;
	for (int i = 0; i < 8/*★*/; i++)
	{
		ss.entry(
			"("
				"([0-9|a-z|A-Z]{1,4})\\s?:\\s?"
				"([0-9|a-z|A-Z]{1,4})\\s?,?\\s?"
			")"
			);
	}
	string pattern = 
		"^\\s*"
		+ ss[0]
		+ ss.implode("?")
		+ "?"
		;
	regex.compile(pattern);

	for (const char **pp = JEF2JISEXSOURCE; *pp; pp++)
	{
		string line = *pp;
		strings match = regex.match(line);
		if (!match.size()) continue;

		WORD jef = 0, jis = 0;
		for (strings::iterator b = match.begin(), i = b, e = match.end()
			; i != e; ++i)
		{
			//[0]-(C2B7:4237,C2BD:423D,C2CD:424D,C2E3:4263)
			//[1]-(C2B7:4237,)
			//[2]-(C2B7)
			//[3]-(4237
			//[4]-(C2BD:423D,)
			//[5]-(C2BD)
			//[6]-(423D)
			// ...
			int index = i - b;
			if (index == 0) continue;
			index -= 1;
			index %= 3;//
			if (index == 0) continue;

			//16進
			WORD value = ::strtol(i->c_str(), 0, 16);

			if (index == 1)
			{
				jef = value;
				continue;
			}
			else 
			{
				jis = value;
				if (jef && jis)
				{
					insert(value_type(jef, jis));
				}
			}

		}
	}

}
//====================================================
//= 変換テーブルの実体
//====================================================
BYTE ebcdic::EBC2SJIS[] = 
{
/*    0     1     2     3     4     5     6     7     8     9     A     B     C     D     E     F   */
/*0*/0x00, 0x01, 0x02, 0x03, 0x20, 0x09, 0x20, 0x7F, 0x20, 0x20, 0x20, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F,  
/*1*/0x10, 0x11, 0x12, 0x13, 0x20, 0x0A, 0x08, 0x20, 0x18, 0x19, 0x20, 0x20, 0x20, 0x1D, 0x1E, 0x1F,  
/*2*/0x20, 0x20, 0x1C, 0x20, 0x20, 0x0A, 0x17, 0x1B, 0x20, 0x20, 0x20, 0x20, 0x20, 0x05, 0x06, 0x07,  
/*3*/0x20, 0x20, 0x16, 0x20, 0x20, 0x20, 0x20, 0x04, 0x20, 0x20, 0x20, 0x20, 0x14, 0x15, 0x20, 0x1A,  
/*4*/0x20, 0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6, 0xA7, 0xA8, 0xA9, 0x5B, 0x2E, 0x3C, 0x28, 0x2B, 0x21, 
/*5*/0x26, 0xAA, 0xAB, 0xAC, 0xAD, 0xAE, 0xAF, 0x20, 0xB0, 0x20, 0x5D, 0x5C, 0x2A, 0x29, 0x3B, 0x5E,  
/*6*/0x2D, 0x2F, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x7C, 0x2C, 0x25, 0x5F, 0x3E, 0x3F,  
/*7*/0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x60, 0x3A, 0x23, 0x40, 0x27, 0x3D, 0x22,  
/*8*/0x20, 0xB1, 0xB2, 0xB3, 0xB4, 0xB5, 0xB6, 0xB7, 0xB8, 0xB9, 0xBA, 0x20, 0xBB, 0xBC, 0xBD, 0xBE,  
/*9*/0xBF, 0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8, 0xC9, 0x20, 0x20, 0xCA, 0xCB, 0xCC,  
/*A*/0x20, 0x7E, 0xCD, 0xCE, 0xCF, 0xD0, 0xD1, 0xD2, 0xD3, 0xD4, 0xD5, 0x20, 0xD6, 0xD7, 0xD8, 0xD9,  
/*B*/0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0xDA, 0xDB, 0xDC, 0xDD, 0xDE, 0xDF,  
/*C*/0x7B, 0x41, 0x42, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,  
/*D*/0x7D, 0x4A, 0x4B, 0x4C, 0x4D, 0x4E, 0x4F, 0x50, 0x51, 0x52, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,  
/*E*/0x24, 0x20, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58, 0x59, 0x5A, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,  
/*F*/0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 
};
const char *ebcdic::JEF2JISEXSOURCE[] = 
{
	"TITLE.CODE CONVERT TBL_B V4.1 L10												", 
	"DATE.1995/10/25																", 
	";;		      //////////////////////////////////								", 
	";;		     //     コード変換テーブル       //									", 
	";;		    //                              //									", 
	";;		   //        （標準コード系用）    //									", 
	";;		  //////////////////////////////////									", 
	";;																				", 
	";;		   COPYRIGHT FUJITSU LIMITED 1995.										", 
	";;		   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~										", 
	";;																				", 
	";;------------------------<システムデェフォルト領域>---------------------------", 
	";;※修正する場合は、注意してください。											", 
	";;※次の内容は、このテンプレートに含まれている主な内容です。					", 
	";;　○印の内容については、コメントになっています。必要に応じてご				", 
	";;　使用ください。																", 
	";;																				", 
	";;	●８３年ＪＩＳ入れ換え文字													", 
	";;	●　　〃　　　追加文字														", 
	";;	○特殊文字																	", 
	";;																				", 
	";;====																			",  
	";;空白																			", 
	";;====																			", 
	";;       JEF:JIS																", 
	"	4040:2121		;(空白)														", 
	";;===================															", 
	";;83年JIS入れ換え文字															", 
	";;===================															", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	F2CD:3033,F2F4:3229,E9DA:3342,D9F8:3349	;鯵 鴬 蛎 撹						", 
	"	DEF5:3443,EBDD:3452,F0F4:375B,E2E8:395C	;潅 諌 頚 砿						", 
	"	ECCD:4128,D4E4:445B,E2EA:4557,DEB9:4573	;賎 壷 砺 涛						", 
	"	EDEE:4676,EAA4:4768,DBD8:4930,D0D6:4B79	;迩 蝿 桧 侭						", 
	"	E9AE:4C79,E4C6:4F36,E3DE:3376,E9A2:3C49	;薮 篭 竃 蕊						", 
	"	F0D7:3F59,DBED:456E,B0B3:724D,B2A9:7274	;靭 梼 鰺 鶯						", 
	"	B3C2:695A,B3C9:5978,B4C3:5E75,B4D2:6B5D	;蠣 攪 灌 諫						", 
	"	B7DB:7074,B9DC:6268,C1A8:6C4D,C4DB:5464	;頸 礦 賤 壺						", 
	"	C5D7:626A,C5F3:5E39,C6F6:6D6E,C7E8:6A24	;礪 濤 邇 蠅						", 
	"	C9B0:5B58,CBF9:5056,CCF9:692E,CFB6:6446	;檜 儘 藪 籠						", 
	"	B3F6:635E,BCC9:6922,BFD9:7057,C5EE:5B6D	;竈 蘂 靱 檮						", 
	";;===============																", 
	";;83年JIS追加文字																", 
	";;===============																", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	B6C6:7421,CBEA:7422,CDDA:7423,E0F6:7424	;堯 槇 遙 瑤						", 
	"	7FD0:223A,7FD1:223B,7FD2:223C,7FD3:223D	;∈ ∋ ⊆ ⊇						", 
	"	7FD4:223E,7FD5:223F,7FD6:2240,7FD7:2241	;⊂ ⊃ ∪ ∩						", 
	"	7FD8:224A,7FD9:224B,76A7:224C,7FDA:224D	;∧ ∨ ￢ ⇒						", 
	"	7FDB:224E,7FDC:224F,7FDD:2250,7FDE:225C	;⇔ ∀ ∃ ∠						", 
	"	7FDF:225D,7FE0:225E,7FE1:225F,7FE2:2260	;⊥ ⌒ ∂ ∇						", 
	"	76AA:2261,76A9:2262,7FE3:2263,7FE4:2264	;≡ ≒ ≪ ≫						", 
	"	7FE5:2265,7FE6:2266,7FE7:2267,76A8:2268	;√ ∽ ∝ ∵						",  
	"	7FE8:2269,7FE9:226A,76D1:2272,76D3:2273	;∫ ∬ Å ‰						", 
	"	7FEA:2274,7FEB:2275,7FEC:2276,7FED:2277	;♯ ♭ ♪ †						", 
	"	7FEE:2278,7FEF:2279,7FF0:227E,7CD1:2821	;‡ ¶ ◯ ─						", 
	"	7CD2:2822,7CC1:2823,7CC2:2824,7CC3:2825	;│ ┌ ┐ ┘						", 
	"	7CC4:2826,7CC7:2827,7CC5:2828,7CC8:2829	;└ ├ ┬ ┤						", 
	"	7CC6:282A,7CC9:282B,7CF6:282C,7CF7:282D	;┴ ┼ ━ ┃						", 
	"	7CE6:282E,7CE7:282F,7CE8:2830,7CE9:2831	;┏ ┓ ┛ ┗						", 
	"	7CF3:2832,7CF1:2833,7CF4:2834,7CF2:2835	;┣ ┳ ┫ ┻						", 
	"	7CF5:2836,7CCA:2837,7CCB:2838,7CCC:2839	;╋ ┠ ┯ ┨						", 
	"	7CC0:283A,7CCE:283B,7FA2:283C,7FA3:283D	;┷ ┿ ┝ ┰						", 
	"	7FA4:283E,7FA1:283F,7CCD:2840		;┥ ┸ ╂								", 
	";;===============																", 
	";;90年JIS追加文字															   	", 
	";;===============																", 
	";;       JEF:JIS																", 
	"	44A4:7425		;凜														   	", 
	"	58A8:7426		;熙														   	", 
	";;===================															", 
	";;83年JIS字体変更文字															", 
	";;===================															", 
	";;８３ＪＩＳで字体が変更された文字についてＪＥＦは、従来の字体をそのまま		", 
	";;ＪＥＦの第一水準，第二水準に残し，新しい字体はＪＥＦの拡張漢字として登		", 
	";;録しました。次のテンプレートは，８３ＪＩＳで字体変更された文字の対応を		", 
	";;示したものです．																", 
	";;【JEF<->JIS変換用】															",  
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	B2FD:327D,B3E5:3365,B3EC:336C,B6C6:3646	;拐 喝 褐 尭						", 
	"	B7A4:3724,B7C5:3745,B7D5:3755,B7E4:3764	;靴 慧 荊 隙						", 
	"	B7F9:3779,B9B7:3937,B9C2:3942,BAE3:3A63	;嫌 昂 溝 冴						", 
	"	BCD7:3C57,BDED:3D6D,BEBF:3E3F,BFE9:3F69	;遮 渚 梢 翠						", 
	"	C0C2:4042,C0F2:4072,C2F5:4275,C2F6:4276	;逝 栓 濯 琢						", 
	"	C3AA:432A,C4CD:444D,C6BE:463E,C6E1:4661	;棚 塚 鴇 那						", 
	"	C8E2:4862,C9D1:4951,CBA2:4B22,CBEA:4B6A	;扉 頻 泡 槙						", 
	"	CBFA:4B7A,CCFE:4C7E,CDDA:4D5A,CECB:4E4B	;繭 癒 遥 遼						", 
	"	D1CB:514B,DBAE:5B2E,DBCA:5B4A,DBF4:5B74	;冕 朞 枴 梍						", 
	"	DCD3:5C53,E0F6:6076,E2AB:622B,E6C6:6646	;樮 瑶 皓 翔						", 
	"	ECE2:6C62,EDEC:6D6C,B0A2:3022,B0B2:3032	;赳 迪 唖 芦						", 
	"	B0BB:303B,B0EE:306E,B0F1:3071,B0F3:3073	;飴 溢 茨 鰯 						", 
	"	B0FC:307C,B1AA:312A,B1B3:3133,B1B5:3135	;淫 迂 嘘 欝						", 
	"	B1B9:3139,B1BD:313D,B1C2:3142,B1EB:316B	;厩 噂 餌 焔						", 
	"	B2A8:3228,B2AA:322A,B2E0:3260,B2E7:3267	;襖 鴎 迦 牙						", 
	"	B2FA:327A,B3A2:3322,B3EB:336B,B3F3:3373	;恢 晦 葛 鞄						", 
	"	B3FA:337A,B4C2:3442,B4CD:344D,B4E5:3465	;噛 澗 翰 翫						", 
	"	B5AB:352B,B5C0:3540,B5E2:3562,B5E8:3568	;徽 祇 汲 笈						", 
	"	B5F4:3574,B6A2:3622,B6AA:362A,B6C2:3642	;渠 侠 卿 饗						", 
	"	B6CF:364F,B6EB:366B,B6ED:366D,B6F4:3674	;僅 矩 躯 喰						", 
	"	B6FB:367B,B6FD:367D,B7B7:3737,B7D2:3752	;櫛 屑 祁 繋						", 
	"	B7F1:3771,B7FD:377D,B7FE:377E,B8B4:3834	;倦 拳 捲 鹸						", 
	"	B8C1:3841,B9AB:392B,B9ED:396D,B9F4:3974	;諺 巷 麹 鵠						", 
	"	B9F9:3979,BAD3:3A53,BAE7:3A67,BAF4:3A74	;甑 采 榊 柵						", 
	"	BBA7:3B27,BBAA:3B2A,BBAC:3B2C,BBB9:3B39	;薩 鯖 錆 珊						", 
	"	BBC1:3B41,BCC8:3C48,BCDD:3C5D,BCDE:3C5E	;餐 屡 杓 灼						", 
	"	BDAB:3D2B,BDB6:3D36,BDEC:3D6C,BDF2:3D72	;繍 酋 曙 薯						", 
	"	BDF3:3D73,BEA5:3E25,BEB3:3E33,BED5:3E55	;藷 哨 廠 蒋						", 
	"	BEDF:3E5F,BEE4:3E64,BFAA:3F2A,BFE0:3F60	;醤 鞘 蝕 逗						", 
	"	C0A2:4022,C0E6:4066,C0F1:4071,C0F9:4079	;摺 蝉 撰 煎						", 
	"	C0FA:407A,C0FC:407C,C0FD:407D,C1A7:4127	;煽 穿 箭 詮						", 
	"	C1B9:4139,C1CC:414C,C1DF:415F,C1E9:4169	;噌 遡 掻 痩						", 
	"	C2B7:4237,C2BD:423D,C2CD:424D,C2E3:4263	;揃 遜 騨 黛						", 
	"	C2FD:427D,C2DC:425C,C2EF:426F,C3A7:4327	;蛸 腿 啄 巽						", 
	"	C3A9:4329,C3AD:432D,C3AE:432E,C3BD:433D	;辿 鱈 樽 箪						", 
	"	C3F5:4375,C3FC:437C,C4BD:443D,C4C8:4448	;瀦 凋 捗 槌						", 
	"	C4CA:444A,C4CF:444F,C5A2:4522,C5A7:4527	;鎚 掴 鄭 擢						", 
	"	C5AE:452E,C5B6:4536,C5BF:453F,C5C6:4546	;溺 填 顛 兎						", 
	"	C5C8:4548,C5CB:454B,C5D1:4551,C5D2:4552	;堵 屠 菟 賭						", 
	"	C5E4:4564,C5F8:4578,C6C2:4642,C6D4:4654	;塘 祷 涜 瀞						", 
	"	C6DB:465B,C6E6:4666,C6E7:4667,C6EA:466A	;遁 謎 灘 楢						", 
	"	C6F6:4676,C7A9:4729,C7AA:472A,C7B9:4739	;迩 禰 祢 嚢						", 
	"	C7D7:4757,C7E7:4767,C7E9:4769,C7ED:476D	;牌 這 秤 剥						", 
	"	C8A4:4824,C8AE:482E,C8B0:4830,C8C0:4840	;箸 溌 醗 叛						", 
	"	C8D4:4854,C8F5:4875,C9A2:4922,C9A3:4923	;挽 樋 柊 稗						", 
	"	C9AF:492F,C9B2:4932,C9B5:4935,C9C0:4940	;逼 媛 謬 廟						", 
	"	C9CE:494E,CAC3:4A43,CACD:4A4D,CACE:4A4E	;瀕 蔽 瞥 蔑						", 
	"	CAD3:4A53,CADA:4A5A,CAF9:4A79,CBA9:4B29	;篇 娩 庖 蓬						", 
	"	CBCB:4B4B,CBF0:4B70,CBF8:4B78,CCCD:4C4D	;頬 鱒 迄 麺						",  
	"	CCD9:4C59,CCDF:4C5F,CCE2:4C62,CCFA:4C7A	;儲 餅 籾 鑓						", 
	"	CCFC:4C7C,CDB2:4D32,CDD4:4D54,CDE9:4D69	;愈 猷 耀 莱						", 
	"	CEFA:4E7A,CEFB:4E7B,CEFC:4E7C,CFA1:4F21	;漣 煉 簾 蓮						", 
	"	CFB1:4F31,CFB9:4F39,D1BD:513D,D1CD:514D	;榔 蝋 兔 冤						", 
	"	D3B0:5330,D3BA:533A,D3DE:535E,D4C4:5444	;唹 唳 嘲 堋						", 
	"	D5BD:553D,D5E3:5563,D6A2:5622,D8A4:5824	;媾 寃 屏 悗						", 
	"	D9E0:5960,D9EC:596C,DAB9:5A39,DBC5:5B45	;捩 搆 攅 枦						", 
	"	DBEB:5B6B,DED0:5E50,E0DF:605F,E1AB:612B	;梛 湮 珎 甄						", 
	"	E2EF:626F,E3CA:634A,E4B9:6439,E4E4:6464	;硼 稱 箙 粐						", 
	"	E5B9:6539,E5BB:653B,E5C6:6546,E7E4:6764	;綛 綮 綟 舮						", 
	"	E7F2:6772,E8BB:683B,EABD:6A3D,EAEF:6A6F	;苒 荵 蟒 褊						", 
	"	EBB2:6B32,EBE6:6B66,ECE9:6C69,EEA9:6E29	;覯 諞 跚 遘						", 
	"	F2CE:724E,F3D1:7351			;鯲 麪											", 
	";;【JEF->JIS変換用】															", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	4FBB:327D,47B8:3365,63EE:336C,47C8:3646	;拐 喝 褐 尭						", 
	"	6CCB:3724,4DC2:3745,61EA:3755,68D2:3764	;靴 慧 荊 隙						", 
	"	49EC:3779,50FC:3937,57C6:3942,44A5:3A63	;嫌 昂 溝 冴						", 
	"	70EC:3C57,55AF:3D6D,52E4:3E3F,5FFE:3F69	;遮 渚 梢 翠						", 
	"	67F5:4042,52E3:4072,57C7:4275,59A1:4276	;逝 栓 濯 琢						", 
	"	52E5:432A,47C9:444D,6EF6:463E,68D9:4661	;棚 塚 鴇 那						", 
	"	4EF9:4862,6CFB:4951,55AE:4B22,54C4:4B6A	;扉 頻 泡 槙						", 
	"	63A1:4B7A,5AF4:4C7E,70EB:4D5A,70ED:4E4B	;繭 癒 遥 遼						", 
	"	43EE:514B,52CD:5B2E,70CA:5B4A,70CC:5B74	;冕 朞 枴 梍						", 
	"	6FD3:5C53,59A2:6076,5BAC:622B,5FFD:6646	;樮 瑶 皓 翔						", 
	"	66B8:6C62,67F4:6D6C,47B9:3022,61B3:3032	;赳 迪 唖 芦						", 
	"	6DC8:303B,57C9:306E,61B4:3071,6EC7:3073	;飴 溢 茨 鰯						", 
	"	57C8:307C,70EE:312A,47BA:3133,54C5:3135	;淫 迂 嘘 欝						", 
	"	45E4:3139,47BB:313D,6DC9:3142,70E0:316B	;厩 噂 餌 焔						", 
	"	63EF:3228,6FB0:322A,70EF:3260,58C5:3267	;襖 鴎 迦 牙						", 
	"	4EEA:327A,51FD:3322,61B5:336B,6CCA:3373	;恢 晦 葛 鞄						", 
	"	47BC:337A,57A6:3442,60B2:344D,60B3:3465	;噛 澗 翰 翫						", 
	"	4DC1:352B,5CCF:3540,70D4:3562,5DEA:3568	;徽 祇 汲 笈						", 
	"	54C6:3574,43CB:3622,45D5:362A,6DCA:3642	;渠 侠 卿 饗						", 
	"	43CC:364F,5BEC:366B,66EA:366D,70B6:3674	;僅 矩 躯 喰						", 
	"	54C7:367B,4AE4:367D,5CD0:3737,5FDF:3752	;櫛 屑 祁 繋						", 
	"	43CD:3771,4FA1:377D,4FA2:377E,6FB5:3834	;倦 拳 捲 鹸						", 
	"	64D5:3841,4BF4:392B,6FC3:396D,6FB1:3974	;諺 巷 麹 鵠						", 
	"	5AB6:3979,58AF:3A53,54C8:3A67,53BE:3A74	;甑 采 榊 柵						", 
	"	61B6:3B27,6EC8:3B2A,69A9:3B2C,59A3:3B39	;薩 鯖 錆 珊						", 
	"	6DCB:3B41,4AE5:3C48,54C9:3C5D,58AA:3C5E	;餐 屡 杓 灼						", 
	"	5FE0:3D2B,43E9:3D36,51FE:3D6C,61B7:3D72	;繍 酋 曙 薯						", 
	"	61B8:3D73,70B7:3E25,4CD1:3E33,61B9:3E55	;藷 哨 廠 蒋						", 
	"	69A1:3E5F,6CCC:3E64,6DCC:3F2A,70F0:3F60	;醤 鞘 蝕 逗						", 
	"	50B7:4022,63B3:4066,50B8:4071,58AB:4079	;摺 蝉 撰 煎						", 
	"	58AC:407A,5DD7:407C,5DEB:407D,64D6:4127	;煽 穿 箭 詮						", 
	"	70B8:4139,70F1:414C,50B9:415F,5AF5:4169	;噌 遡 掻 痩						", 
	"	50BA:4237,70F7:423D,6DF8:424D,6FD8:4263	;揃 遜 騨 黛						", 
	"	63B4:427D,52E2:425C,70B9:426F,4BF5:4327	;蛸 腿 啄 巽						", 
	"	70F6:4329,6EC9:432D,70C3:432E,5EC2:433D	;辿 鱈 樽 箪						", 
	"	70D5:4375,44A6:437C,50BC:443D,70C4:4448	;瀦 凋 捗 槌						", 
	"	69AA:444A,50BB:444F,68DE:4522,70BE:4527	;鎚 掴 鄭 擢						", 
	"	70D6:452E,47CA:4536,6CFC:453F,43DA:4546	;溺 填 顛 兎						", 
	"	47CB:4548,4AE6:454B,62FC:4551,66B2:4552	;堵 屠 菟 賭						", 
	"	48C7:4564,5CEC:4578,70D7:4642,70D8:4654	;塘 祷 涜 瀞						", 
	"	70F5:465B,64D7:4666,70D9:4667,70C5:466A	;遁 謎 灘 楢						", 
	"	70FC:4676,5CED:4729,70E4:472A,70BA:4739	;迩 禰 祢 嚢						", 
	"	58BF:4757,70F2:4767,5DC6:4769,44D0:476D	;牌 這 秤 剥						", 
	"	5EC3:4824,70DA:482E,69A2:4830,45EC:4840	;箸 溌 醗 叛						", 
	"	70BF:4854,70C6:4875,70C7:4922,5DC7:4923	;挽 樋 柊 稗						", 
	"	70F3:492F,49ED:4932,65D4:4935,4CD2:4940	;逼 媛 謬 廟						", 
	"	70DB:494E,62FD:4A43,5BE3:4A4D,62FE:4A4E	;瀕 蔽 瞥 蔑						", 
	"	5EC4:4A53,49EE:4A5A,4CD3:4A79,63A4:4B29	;篇 娩 庖 蓬						", 
	"	6CFD:4B4B,6EEC:4B70,70F4:4B78,6FC4:4C4D	;頬 鱒 迄 麺						", 
	"	43CE:4C59,6DCD:4C5F,5EDD:4C62,69AB:4C7A	;儲 餅 籾 鑓						", 
	"	4EEB:4C7C,58F9:4D32,6BFE:4D54,63A2:4D69	;愈 猷 耀 莱						",  
	"	70DC:4E7A,58AD:4E7B,5EC5:4E7C,63A3:4F21	;漣 煉 簾 蓮						", 
	"	70C8:4F31,63B5:4F39,43DB:513D,43F0:514D	;榔 蝋 兔 冤						", 
	"	70BB:5330,70BC:533A,70BD:535E,48C8:5444	;唹 唳 嘲 堋						", 
	"	49EF:553D,4AC8:5563,4AE7:5622,4EEC:5824	;媾 寃 屏 悗						", 
	"	70C0:5960,70C1:596C,50B1:5A39,70C9:5B45	;捩 搆 攅 枦						", 
	"	70CB:5B6B,70DD:5E50,5AAB:605F,5AB7:612B	;梛 湮 珎 甄						", 
	"	5CCD:626F,5DC8:634A,5EC6:6439,5EDE:6464	;硼 稱 箙 粐						", 
	"	5FE1:6539,5FE3:653B,5FE2:6546,60FE:6764	;綛 綮 綟 舮						", 
	"	63A5:6772,70E6:683B,63DE:6A3D,64B4:6A6F	;苒 荵 蟒 褊						", 
	"	64CC:6B32,65D5:6B66,66E2:6C69,70F8:6E29	;覯 諞 跚 遘						", 
	"	6EED:724E,6FC5:7351			;鯲 麪											", 
	";;========																		", 
	";;特殊文字																		", 
	";;========																		", 
	";;　１３区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	77C9:2D21,77CA:2D22,77CB:2D23,77CC:2D24	;① ② ③ ④						", 
	"	77CD:2D25,77CE:2D26,77CF:2D27,77D0:2D28	;⑤ ⑥ ⑦ ⑧						", 
	"	77D1:2D29,77D2:2D2A,77D3:2D2B,77D4:2D2C	;⑨ ⑩ ⑪ ⑫						", 
	"	77D5:2D2D,77D6:2D2E,77D7:2D2F,77D8:2D30	;⑬ ⑭ ⑮ ⑯						", 
	"	77D9:2D31,77DA:2D32,77DB:2D33,77DC:2D34	;⑰ ⑱ ⑲ ⑳						", 
	"	77DE:2D35,77DF:2D36,77E0:2D37,77E1:2D38	;Ⅰ Ⅱ Ⅲ Ⅳ						", 
	"	77E2:2D39,77E3:2D3A,77E4:2D3B,77E5:2D3C	;Ⅴ Ⅵ Ⅶ Ⅷ						", 
	"	77E6:2D3D,77E7:2D3E,          76DA:2D40	;Ⅸ Ⅹ ・ ㍉						", 
	"	76DC:2D41,76DB:2D42,76D9:2D43,76DE:2D44	;㌔ ㌢ ㍍ ㌘						", 
	"	76E0:2D45,76E1:2D46,76E2:2D47		;㌧ ㌃ ㌶ ㍑							", 
	"	76E7:2D49,76E6:2D4A,76E3:2D4B,76E4:2D4C	;㍗ ㌍ ㌦ ㌣						", 
	"	76E5:2D4D,76E9:2D4E,76EB:2D4F,76BC:2D50	;㌫ ㍊ ㌻ ㎜						", 
	"	76BD:2D51,76BE:2D52,76C4:2D53,76C5:2D54	;㎝ ㎞ ㎎ ㎏						", 
	"	76C6:2D55,76C0:2D56			;㏄ ㎡ ・ ・									", 
	"						;・ ・ ・ ・											", 
	"						;・ ・ ㍻ 〝											", 
	"	          76FA:2D62,76F4:2D63,76F6:2D64	;〟 № ㏍ ℡						", 
	"						;㊤ ㊥ ㊦ ㊧											", 
	"	          78D5:2D6A,78CF:2D6B,78CB:2D6C	;㊨ ㈱ ㈲ ㈹						", 
	"	                              76A9:2D70	;㍾ ㍽ ㍼ ≒						", 
	"	76AA:2D71				;≡ ∫ ∮ ∑										", 
	"	7FE5:2D75,7FDF:2D76,7FDE:2D77		;√ ⊥ ∠ ∟							", 
	"	          76A8:2D7A,7FD7:2D7B,7FD6:2D7C	;⊿ ∵ ∩ ∪						", 
	";;１１５区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	77EB:9321,77EC:9322,77ED:9323,77EE:9324	;ⅰ ⅱ ⅲ ⅳ						", 
	"	77EF:9325,77F0:9326,77F1:9327,77F2:9328	;ⅴ ⅵ ⅶ ⅷ						", 
	"	77F3:9329,77F4:932A,77DE:932B,77DF:932C	;ⅸ ⅹ Ⅰ Ⅱ						", 
	"	77E0:932D,77E1:932E,77E2:932F,77E3:9330	;Ⅲ Ⅳ Ⅴ Ⅵ						", 
	"	77E4:9331,77E5:9332,77E6:9333,77E7:9334	;Ⅶ Ⅷ Ⅸ Ⅹ						", 
	"	76A7:9335,76A1:9336,76A2:9337,76A3:9338	;￢ ￤ ＇ ＂						", 
	"	78D5:9339,76FA:933A,76F6:933B,76A8:933C	;㈱ № ℡ ∵						", 
	"	5FDC:933D,64B5:933E,6AD9:933F,69FE:9340	;纊 褜 鍈 銈						", 
	"	62C4:9341,42C7:9342,70E1:9343,51A3:9344	;蓜 俉 炻 昱						", 
	"	70CD:9345,6AC9:9346,51FC:9347,4CF6:9348	;棈 鋹 曻 彅						", 
	"	41AC:9349,41E8:934A,43CF:934B,41EF:934C	;丨 仡 仼 伀						",  
	"	41F0:934D,41FB:934E,42A8:934F,42B5:9350	;伃 伹 佖 侒						", 
	"	42B3:9351,42B9:9352,42B7:9353,42CA:9354	;侊 侚 侔 俍						", 
	"	42E7:9355,42DF:9356,43D0:9357,42DE:9358	;偀 倢 俿 倞						", 
	"	42E9:9359,42F5:935A,42E8:935B,42FC:935C	;偆 偰 偂 傔						", 
	"	43B9:935D,43B2:935E,43D3:935F,43D9:9360	;僴 僘 兊 兤						", 
	"	43F2:9361,43F7:9362,44AC:9363,44B4:9364	;冝 冾 凬 刕						", 
	"	44F7:9365,44D2:9366,44FA:9367,44ED:9368	;劜 劦 勀 勛						", 
	"	45A3:9369,45A8:936A,45B3:936B,45D2:936C	;匀 匇 匤 卲						", 
	"	45DB:936D,45E2:936E,45F3:936F,45F2:9370	;厓 厲 叝 﨎						", 
	"	46C4:9371,46C1:9372,46C9:9373,45FA:9374	;咜 咊 咩 哿						", 
	"	45F6:9375,48C9:9376,48CA:9377,48CB:9378	;喆 坙 坥 垬						", 
	"	47F7:9379,47F6:937A,48CC:937B,C4CD:937C	;埈 埇 﨏 塚						", 
	"	48BB:937D,48CD:937E			;增 墲											", 
	";;１１６区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	48D0:9421,48E3:9422,48E4:9423,48E5:9424	;夋 奓 奛 奝						", 
	"	48EB:9425,49A3:9426,49F0:9427,49F2:9428	;奣 妤 妺 孖						", 
	"	4AC9:9429,4ABD:942A,4AC0:942B,4AC6:942C	;寀 甯 寘 寬						", 
	"	4AD4:942D,4AF1:942E,4AF3:942F,4BE4:9430	;尞 岦 岺 峵						", 
	"	4AFB:9431,4BA3:9432,4BD0:9433,4BA2:9434	;崧 嵓 﨑 嵂						", 
	"	4BD3:9435,4BDF:9436,4BE0:9437,4BE5:9438	;嵭 嶸 嶹 巐						", 
	"	4CEB:9439,4CEE:943A,4DA2:943B,4DC0:943C	;弡 弴 彧 德						", 
	"	4DC7:943D,4DCC:943E,4EA8:943F,4DD0:9440	;忞 恝 悅 悊						", 
	"	4EC1:9441,4EBD:9442,4EED:9443,4EC2:9444	;惞 惕 愠 惲						", 
	"	4EEE:9445,4ED0:9446,4ECE:9447,4EDB:9448	;愑 愷 愰 憘						", 
	"	4EF7:9449,4FB5:944A,4FED:944B,4FFA:944C	;戓 抦 揵 摠						", 
	"	50A2:944D,4FA7:944E,50C9:944F,51BD:9450	;撝 擎 敎 昀						", 
	"	51C4:9451,50FC:9452,51C0:9453,51A1:9454	;昕 昻 昉 昮						",  
	"	51C7:9455,51CA:9456,51D9:9457,52A1:9458	;昞 昤 晥 晗						", 
	"	51D4:9459,51DE:945A,51B3:945B,51E5:945C	;晙 晴 晳 暙						", 
	"	51AB:945D,51EB:945E,51F1:945F,52A2:9460	;暠 暲 暿 曺						", 
	"	52BC:9461,52AD:9462,70CE:9463,53B2:9464	;朎 朗 杦 枻						", 
	"	52EE:9465,53B4:9466,53C0:9467,53C7:9468	;桒 柀 栁 桄						", 
	"	70CF:9469,70D0:946A,53ED:946B,70D1:946C	;棏 﨓 楨 﨔						", 
	"	52F4:946D,70D2:946E,70D3:946F,54AD:9470	;榘 槢 樰 橫						", 
	"	52E8:9471,54AF:9472,54B0:9473,54BC:9474	;橆 橳 橾 櫢						", 
	"	54BD:9475,54F8:9476,55B5:9477,55BD:9478	;櫤 毖 氿 汜						", 
	"	55C3:9479,55BF:947A,55D3:947B,55DE:947C	;沆 汯 泚 洄						", 
	"	56A3:947D,70DE:947E			;涇 浯											", 
	";;１１７区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	56A7:9521,56AD:9522,56B2:9523,56B8:9524	;涖 涬 淏 淸						", 
	"	70DF:9525,55B1:9526,56C2:9527,56CF:9528	;淲 淼 渹 湜						", 
	"	56BE:9529,56C3:952A,56DF:952B,56FE:952C	;渧 渼 溿 澈						", 
	"	57AE:952D,57B8:952E,57B9:952F,57BA:9530	;澵 濵 瀅 瀇						", 
	"	57BC:9531,57D1:9532,57DE:9533,58A6:9534	;瀨 炅 炫 焏						", 
	"	58A5:9535,57F1:9536,57EB:9537,57EC:9538	;焄 煜 煆 煇						", 
	"	70E3:9539,57F6:953A,58A9:953B,58FA:953C	;凞 燁 燾 犱						", 
	"	58D6:953D,58ED:953E,58EF:953F,58F6:9540	;犾 猤 猪 獷						", 
	"	59BA:9541,59BC:9542,59C0:9543,59C3:9544	;玽 珉 珖 珣						", 
	"	5AAC:9545,59D0:9546,59C7:9547,59D7:9548	;珒 琇 珵 琦						", 
	"	59DA:9549,59D9:954A,59DD:954B,5AAD:954C	;琪 琩 琮 瑢						", 
	"	59F4:954D,59FB:954E,5AB8:954F,5AD0:9550	;璉 璟 甁 畯						", 
	"	5AFE:9551,5BA4:9552,5BA5:9553,5AFD:9554	;皂 皜 皞 皛						", 
	"	5BA9:9555,5BB7:9556,5BCC:9557,44DC:9558	;皦 益 睆 劯						", 
	"	5BFC:9559,5CA7:955A,5CAE:955B,5CB2:955C	;砡 硎 硤 硺						", 
	"	5CCE:955D,70E5:955E,5CDA:955F,5CDC:9560	;礰 礼 神 祥						", 
	"	5CE6:9561,5CE4:9562,5CE8:9563,5DDD:9564	;禔 福 禛 竑						", 
	"	5DE1:9565,5DE5:9566,5DE4:9567,5EA3:9568	;竧 靖 竫 箞						", 
	"	5ED3:9569,5EFD:956A,5EE0:956B,5FE4:956C	;精 絈 絜 綷						", 
	"	5FB6:956D,5FBE:956E,5FD6:956F,5FE8:9570	;綠 緖 繒 罇						", 
	"	5FF7:9571,60A1:9572,61D9:9573,70E7:9574	;羡 羽 茁 荢						", 
	"	61F0:9575,61FE:9576,62AA:9577,70E8:9578	;荿 菇 菶 葈						", 
	"	70E9:9579,62D1:957A,62D4:957B,62D9:957C	;蒴 蕓 蕙 蕫						", 
	"	62E4:957D,62E5:957E			;﨟 薰											", 
	";;１１８区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	70EA:9621,63DF:9622,63E0:9623,63F9:9624	;蘒 﨡 蠇 裵						", 
	"	64E4:9625,64EC:9626,64DA:9627,65A7:9628	;訒 訷 詹 誧						", 
	"	6BEA:9629,65B3:962A,65B7:962B,65B6:962C	;誾 諟 諸 諶						", 
	"	65C7:962D,65D1:962E,66AB:962F,65F9:9630	;譓 譿 賰 賴						", 
	"	65F8:9631,66B9:9632,66C3:9633,66ED:9634	;贒 赶 﨣 軏						", 
	"	70F9:9635,70FB:9636,70FA:9637,68A6:9638	;﨤 逸 遧 郞						",  
	"	68A8:9639,68DF:963A,68B0:963B,69BE:963C	;都 鄕 鄧 釚						", 
	"	69BC:963D,69BF:963E,69C5:963F,69C6:9640	;釗 釞 釭 釮						", 
	"	69C0:9641,69C1:9642,69CD:9643,69D1:9644	;釤 釥 鈆 鈐						", 
	"	69D0:9645,69E1:9646,69E4:9647,69E2:9648	;鈊 鈺 鉀 鈼						", 
	"	69E8:9649,69EE:964A,69EA:964B,69E0:964C	;鉎 鉙 鉑 鈹						", 
	"	6BD2:964D,6AA7:964E,69F7:964F,69F8:9650	;鉧 銧 鉷 鉸						", 
	"	6AC4:9651,6ABC:9652,6ABE:9653,6AB8:9654	;鋧 鋗 鋙 鋐						", 
	"	6BD3:9655,6ABB:9656,6AC2:9657,6ABA:9658	;﨧 鋕 鋠 鋓						", 
	"	6AD5:9659,6AD3:965A,69B3:965B,6BD4:965C	;錥 錡 鋻 﨨						", 
	"	6AD1:965D,6ACA:965E,6AD0:965F,6ACC:9660	;錞 鋿 錝 錂						", 
	"	6AE4:9661,6ADE:9662,6AF2:9663,6AF9:9664	;鍰 鍗 鎤 鏆						", 
	"	6BA3:9665,6BAE:9666,6BBD:9667,6BC5:9668	;鏞 鏸 鐱 鑅						", 
	"	6BC6:9669,6BE1:966A,68CC:966B,68E0:966C	;鑈 閒 隆 﨩						", 
	"	68D4:966D,68DB:966E,6CAC:966F,6CAD:9670	;隝 隯 霳 霻						", 
	"	6CB0:9671,6CB1:9672,6CAE:9673,6CB3:9674	;靃 靍 靏 靑						", 
	"	6CB5:9675,6CF3:9676,6CF7:9677,6DB3:9678	;靕 顗 顥 飯						", 
	"	6DB4:9679,6DBD:967A,6DBE:967B,5CF3:967C	;飼 餧 館 馞						", 
	"	6DF6:967D,6EA4:967E			;驎 髙											", 
	";;１１９区																		", 
	";;       JEF:JIS   JEF:JIS   JEF:JIS   JEF:JIS									", 
	"	6EA7:9721,6ED0:9722,6EEE:9723,6ED8:9724	;髜 魵 魲 鮏						", 
	"	6EDB:9725,6EEF:9726,6EE3:9727,6FA3:9728	;鮱 鮻 鰀 鵰						", 
	"	6FA1:9729,6FB2:972A,6FAE:972B,6FD6:972C	;鵫 鶴 鸙 黑						", 
	";;-----------------------------<利用者指定領域>--------------------------------", 
	";;※これより下に追加してください．												", 
	";;	XXXX:YYYY		;　XXXX:JEFコード，YYYY:JISコード							", 
	0x00, //ターミネータ★
};